{
  "Rules": {
    "Summary": "The Island is a game where the last one standing wins. Unless explicitly stated, Everyday someone will be kicked off the Island by a vote of the survivors on the Island. The Island has mutual relationships such as the Hunter and the Cook, and competitive relationships like the Hunter and the Fisher. There are 4 Secret Roles that have varying levels of impact on the Island. There's ones that are immediate threats like the Cannibal or Werewolf, and ones that are highly dependent on the user such as the Wizard and Mimic. Your goal doesn't have to be to get rid of the Secret Roles, as the Secret Roles will be irrelevant once there are 5 people left on the Island. However, getting rid of the Secret Roles can greatly increase your chances of survival. The weather, survivors, special events, and even the Island itself are what you are playing against.",

    "Rules for the Days": "Day 1 - Day 1 is an important day in determining how the rest of the Island will usually be played. The Moon is chosen by the previous Island's Winner to begin the Moon Cycle. No one will be voted off on Day 1, however, death is still a possibility.\n\nNormal Day: On normal days, a vote will take place to vote someone off the Island for that day. (You can even vote on yourself)\n\nThe Sixth Day: The Sixth Day on the Island is set aside for Special Events. There is a chance that no vote will be held that day, but this is not guaranteed.\n\nTies: In the case of a tie, a revote will be taking place to kick someone off. If there is another tie, no one will be kicked off the Island and the next day will take place.\n\nDeath: If the person that was going to be kicked off is killed, the day will continue to the next.\n\nFinal 2 Voting: Only those who were kicked off will be able to vote on the Final 2 to decide a winner. If there is a tie, the dead will break the tie by a majority vote.\n\nFinal 3 Death: There is a possibility that the game can end with a vote and a death in the Final 3. If this is the case the winner will skip the Final 2 Voting Rule.\n\nIf You don't vote: Not voting for a day will vote on the last person you voted on automatically. If you don't vote for 2 days straight your vote no longer gets counted.",

    "A Single Day": "I started doing this to show you how the day naturally progress, so there isn't steps that aren't missed. Don't worry about the Time of the Day, play the game the same, this is just for me to better sort out how I do announcements.\n\nMorning: The Start of the Day will show the new Health/Food of the survivors\n\nNoon to Evening: These are major changes that happen such as player's being brought back or roles being changed\n\nNight to Late Night: This is when I will announce who is kicked off and has died to the Cannibal/Werewolf. By the Time this announcement has been made everything will be locked in.\n\nMidnight: This is where all the Heals and Poison are calculated. This is so the survivors know what health they have going into the next day.",

    "Health Bar": "The Health Bar has 10 points\nIf the Health Bar ever hits 0, it will count as a Death for the player\n\nAt the End of the Day I will calculate the amount of Health one has gain or lost. Its a basic calculation. For Example: Lets say you get Medic poisoned and eat a Tasty Tangerine and you're at 10/10.\n- Medic -2\n- Tasty Tangerine +3\n- Total +1\nSo you would stay at 10/10 as one can't get over that. That will be your health by the end of the day.\n\nTransitioning to the Next Day:\nThe calculation I will be doing is very dependent on the Weather and Food.\n\nWeather:\nGood Structure / Good Clothing:\n- Clear, Rainy, Hot, Cold will be a +1 to Health\n- Heat Wave or Freezing will be a 0 to Health\n\nGood Structure / Bad Clothing:\n- Clear Weather will be a +1 to Health\n- Rainy, Hot, Cold will be a +0 to Health\n- Heat Wave, Freezing will be a -1 to Health\n\nBad Structure / Good Clothing:\n- Clear Weather will be a +1 to Health\n- Rainy, Hot, Cold, Heat Wave, Freezing will be a +0 to Health\n\nBad Structure / Bad Clothing:\n- Clear Weather will be a +0 to Health\n- Rainy, Hot, Cold, Heat Wave, Freezing will be a -1 Health\n\nFood:\nEvery 2 consecutive days that food is found on the Island will be a +1 to Health\nEvery 2 consecutive day that there is no food found there will be a -1 to Health\n\nThis happens only for consecutive days by 2. So as an example to clarify. I will give the following conditions if food is found everyday there will a +1 added every two consecutive days.\n\nDay 1: Food is found\nDay 2: Food is found +1 to Health\nDay 3: Food is found\nDay 4: Food is found +1 to Health\nDay 5: Food is not found\nDay 6: Food is not found -1 to Health\nDay 7: Food is found\nDay 8: Food is not found\nDay 9: Food is not found -1 to Health\nDay 10: Food is not found",

    "Heals/Poisons": "Heals:\nBard: 2 Heart Points and 0 Hunger Points\nSage Soup: 2 Heart Points and 2 Hunger Points\nMedic: 2 Heart Points and 1 Hunger Points\nTasty Tangerines: 3 Heart Points and 3 Hunger Points\nWizard: 3 Heart Points and 3 Hunger Points\n\nPoisons:\nAssassin: 1 Heart Point and 1 Hunger Points\nCook: 1 Heart Point and 2 Hunger Points\nMedic: 2 Heart Points and 1 Hunger Points\nWizard: 3 Heart Points and 3 Hunger Points",

    "Food Bar": "The Food Bar has 10 points\n\nFood:\nEveryday that food is found will be a +1 Hunger\nEveryday that food isn't found will be a -1 Hunger\nIf the Hunger Bar ever hits 0 there will be a -1 Health",

    "Lies/Storytelling": "There are two abilities on the Island that can make up information, The Bard's Storytelling and the Hunter's Envious Fox. I make announcement that they have used the ability, however I do not say how and to who they are telling a story to. Think of both of these abilities as a way to say something direct to a survivor, it doesn't have to be a lie. You can say anything to a player but I will clarify what has to get announced to preserve the lie.\nHere are some example lies:\n- Telling the Nightguard that they have seen the Cannibal and it was `SELECTED PLAYER`\n  - I will announce that the Nightguard has spotted someone\n  - This will overwrite whatever the truth was entirely\n- Telling the Nightguard that they haven't seen anyone\n  - I will NOT announce anything here\n  - This will overwrite whatever the truth was entirely\n- Telling the interrogator that the player they interrogated (I will use the Medic as an example):\n  - Voted: `SELECTED PLAYER`\n  - Healed: `SELECTED PLAYER`\n  - Poisoned: `SELECTED PLAYER`\n  - Is a Secret Role, or isn't a Secret Role\n  - This will overwrite whatever the truth is entirely\n- Telling the Interrogator that they have failed the interrogation\n  - This will overwrite whatever the truth is\n- Telling the Assassin that `SELECTED PLAYER` voted for them\n  - This doesn't mean that the Assassin can attack them, but its just to make them waste an attack on a player that didn't vote on them. There is no threat to the `SELECTED PLAYER`, instead its to perhaps get the target off you, as I will allow for your name to be removed in place of a player. Or if it will someone else, it will overwrite a random player that voted on them. This won't overwrite everyone just the one or multiple names you say. Let's say 3 people have voted on the Assassin, and you tell me 2 peoples names, 2 out of those 3 original people's names will be changed.\n- Telling the Assassin that `SELECTED PLAYER` want the Assassin to kill `SELECTED PLAYER`\n  - This won't overwrite an actual request, instead the Assassin will now have to choose between those two. If they choose the lie, nothing will happen. Obviously, if no real request was made, the fake request will be the only one told.\n\nThese are some examples on how one would do a lie. There is currently no way to straight up do a global announcement such as me telling everyone that a selected player got Armor, but maybe in the future I will.",

    "Day Cooldowns": "Certain abilities have cooldowns, when should you know when your cooldown is done? Let's say I want to use an ability with a 3 day cooldown on Day 1. All you have to do is add +3 to the current day you used the ability and that day's number is the next time you'd be able to use it. For the above example a 3 day cooldown used on Day 1 will take until Day 4 to use again as 1+3=4.\n\nCooldowns are tied to a Player, not the Role itself. Nothing resets the cooldown.\n\nWhat about Temporal Reset?\nTemporal Reset will just place the cooldown to where the cooldown was on that day. Let's say Temporal Reset is used on Day 3 to go back to Day 2, my 3 day cooldown will still not come back up until Day 4.",

    "Teaching": "The Teacher has the ability to change someone's role, How does that work? What about a previous roles action? What if a player has been brought back?\n\nIn general your previous role's action won't happen, instead you will be doing your new role's action. Your previous Roles actions only happen if I have announced it. However, if I have announced your previous roles actions I will allow for the Role to be changed, but no actions from the new role will be allowed. This will go for the Teacher as well, if the teacher decides to buff themselves and then changes to be a medic, the Teacher buff will be taken away.",

    "Role Disabled": "People can have their roles disabled. What if they weaken each other?\nThe Priority will be as follows:\n1. Wizard's Weaken\n2. Jailor's Jail\n3. A Food Roles Weaken\nLet's say that The Hunter gets the Jinxed Jackrabbit and the Fisher gets the Cursed Cuttlefish Ink. If both roles get this and use it on each other on the same day, they would have caught the Special Items/Animals but their vote is cancelled.",

    "What is kept on Your Role?": "Players can be given special items, but what happens if you are kicked off or killed and then brought back?\n- The Machete From Hell will be lost\n- The Special Clothes from the Tailor will be lost\n- The Bard will keep the Weather Rock\n- The Cook's food will be lost\n- The Farmer will keep the Notch Apple, nothing else\n- The Fisher will keep Moby Dick's Harpoon, nothing else\n- The Hunter will keep Sif, The Great Grey Wolf, nothing else\n\nWhat if I was role swapped or taught a different role and then became that role again?\n- Everything will be lost",

    "Disqualifications": "If you break any of the following rules, I will give you a warning, but if you continue I will disqualify you from the current Island game.\nNo Screenshots\n- No Screenshotting Private Channels! You cannot screenshot any PRIVATE conversations with the Game Makers or other survivors.\nNo Hazing\n- I want people to be welcomed to play the game, if I sense that there is actual hostility from you, I will disqualify you as it that isn't the spirit of the game. The game is suppose to be fun for all!"
  }
}